name = input('Введите имя ')
surname = input('Введите фамилию ')
age = input('Введите ваш возраст ')
while not age.isdigit():
    age = input('Ответ может содержать только цифры! Попробуйте еще раз! ')
weight = input('Введите ваш вес ')
while not weight.isdigit():
    weight = input('Ответ может содержать только цифры! Попробуйте еще раз! ')
if int(age) <= 30:
    sport = input('Регулярные физические нагрузки: да/нет ')
    while sport != 'нет' and sport != 'да':
        sport = input('Ответ может содержать только "да" или "нет"! Попробуйте еще раз! ')
    if int(weight) >= 50 and int(weight) <= 120:
        if sport == 'да':
            print('Так дрежать! Хорошее состояние')
        else:
            print('Хорошее состояние, но это ненадолго...')
    else:
        print('Регулярные занятия спортом помогут набрать мышечную массу или сбросить лишний вес.')
elif int(age) <=40:
    if int(weight) < 50 or int(weight) > 120:
        sport = input('Регулярные физические нагрузки: да/нет ')
        while sport != 'нет' and sport != 'да':
            sport = input('Ответ может содержать только "да" или "нет"! Попробуйте еще раз! ')
        if sport == 'да':
            print('Есть серьезные проблемы со здоровьем. Обратитесь к врачу!')
        else:
            print('Следуюет заняться собой и перейти на ЗОЖ!')

    else:
        print('Так дрежать! Хорошее состояние')
else:
    if int(weight) < 50 or int(weight) > 120:
            print('Есть серьезные проблемы со здоровьем. Обратитесь к врачу!')
    else:
        print('Так дрежать! Хорошее состояние')


