# Задача-4: Дан список, заполненный произвольными целыми числами.
# Получите новый список, элементами которого будут:
# а) неповторяющиеся элементы исходного списка:
# например, lst = [1, 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 2, 4, 5, 6]
# б) элементы исходного списка, которые не имеют повторений:
# например, lst = [1 , 2, 4, 5, 6, 2, 5, 2], нужно получить lst2 = [1, 4, 6]

#a
list1 = [1, 2, 4, 5, 6, 2, 5, 2, 7, 2, 6]
list_wo_dupl = list(set(list1))
print(list_wo_dupl)

#b
list_unic = []
for x in list1:
    if list1.count(x) == 1:
        list_unic.append(x)

print(list_unic)

