# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

fruits = ['яблоко', 'банан', 'киви', 'арбуз']
i = 1
for fruit in fruits:
    print('{} {} {:>7}'.format(i, '.', fruit))
    i += 1

