# Задача-1:
# Дан список, заполненный произвольными целыми числами, получите новый список,
# элементами которого будут квадратные корни элементов исходного списка,
# но только если результаты извлечения корня не имеют десятичной части и
# если такой корень вообще можно извлечь
# Пример: Дано: [2, -5, 8, 9, -25, 25, 4]   Результат: [3, 5, 2]

list = [2, -5, 8, 9, -100, 100, 4, 7, -25, 36]
list2 = []

for x in list:
    if x >= 0:
        sqrt = x**(.5)
        if sqrt % 1 == 0:
            list2.append(int(sqrt))

print(list2)
