# Задача-3: Напишите алгоритм, заполняющий список произвольными целыми числами
# в диапазоне от -100 до 100. В списке должно быть n - элементов.
# Подсказка:
# для получения случайного числа используйте функцию randint() модуля random

n = int(input('введите количество элементов '))
list = []
i = 0
import random
while i < n:
    x = random.randint(-100, 100)
    list.append(x)
    i += 1
print(list)

