# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

list1 = [1, 2, 2, 3, 4, 4, 5, 2, 5, 6, 7, 8]
list2 = [2, 4, 6, 6, 8]
i = 0
j = 0

while i < len(list1):
    if list2.count(list1[i]) > 0:
        list1.remove(list1[i])
    else:
        i += 1


print(list1)





