# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

list = [2, 3, 4, 6, 7, 8, 2, 4, 1, 9]
i = 0
for x in list:
     if (x % 2) == 0 :
         x /= 4
         list[i] = x
         i += 1
     else:
         x *= 2
         list[i] = x
         i += 1

print(list)

