# Задание-2: Дата задана в виде строки формата 'dd.mm.yyyy'.
# Проверить, корректно ли введена дата.
# Условия корректности:
# 1. День должен приводиться к целому числу в диапазоне от 1 до 30(31)
#  (в зависимости от месяца, февраль не учитываем)
# 2. Месяц должен приводиться к целому числу в диапазоне от 1 до 12
# 3. Год должен приводиться к целому положительному числу в диапазоне от 1 до 9999
# 4. Длина исходной строки для частей должна быть в соответствии с форматом
#  (т.е. 2 символа для дня, 2 - для месяца, 4 - для года)

# Пример корректной даты
#date = '01.11.1985'

# Примеры некорректных дат
#date = '01.22.1001'
#date = '1.12.1001'
#date = '-2.10.3001'

data_str = input('Введите дату в формате дд.мм.гггг: ')
data_list = data_str.split('.')
d = int(data_list[0])
m = int(data_list[1])
y = int(data_list[2])


while len(data_list[0]) != 2 or d < 1 or d > 31 or m < 1 or m > 12 or len(data_list[1]) != 2 or len(data_list[2]) != 4 or y < 1 or y > 9999 or ((m == 2 or m == 4 or m == 6 or m == 11) and d == 31):
    data_str = input('Ошибка ввода! Попробуйте еще раз: ')
    data_list = data_str.split('.')
    d = int(data_list[0])
    m = int(data_list[1])
    y = int(data_list[2])

else:
    print('Все ок')







