# Задание - 1
# Вам даны 2 списка одинаковой длины, в первом списке имена людей, во втором зарплаты,
# вам необходимо получить на выходе словарь, где ключ - имя, значение - зарплата.
# Запишите результаты в файл salary.txt так, чтобы на каждой строке было 2 столбца,
# столбцы разделяются пробелом, тире, пробелом. в первом имя, во втором зарплата, например: Vasya - 5000
# После чего прочитайте файл, выведите построчно имя и зарплату минус 13% (налоги ведь),
# Есть условие, не отображать людей получающих более зарплату 500000, как именно
#  выполнить условие решать вам, можете не писать в файл
# можете не выводить, подумайте какой способ будет наиболее правильным и оптимальным,
#  если скажем эти файлы потом придется передавать.
# Так же при выводе имя должно быть полностью в верхнем регистре!
# Подумайте вспоминая урок, как это можно сделать максимально кратко, используя возможности языка Python.



name = ['Vasya', 'Lena', 'Kostya', 'Katya', 'Anastasya', 'Ivan']
salary = [30000, 15000, 55000, 25800, 80000, 510000]
person_file = dict(zip(name, salary))


with open('salary.txt','a', encoding='utf-8') as file:
    for key, sal in person_file.items():
        if sal <= 500000:
            file.write('%s - %i\n' % (key, sal))


with open('salary.txt') as f:
    for line in f.readlines():
        str = line.split()
        zp = int(int(str[2])*0.87)
        nm = str[0].upper()
        print(nm, zp)










