# Задание - 1
# Создайте функцию, принимающую на вход Имя, возраст и город проживания человека
# Функция должна возвращать строку вида "Василий, 21 год(а), проживает в городе Москва"





def person_file(name, age, city):
     return ' %s, %s год(а), проживает в городе %s.' % (name, age, city) #мой python34 не воспринимает более варианты форматирования((


n = input('Ваше имя: ')
a = input('Полных лет: ')
c = input('Город проживания: ')
print(person_file(n, a, c))




