# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

import random
list1 = [random.randint(-50,50) for _ in range(10)]
print(list1)

list2 = [i for i in list1 if i > 0 and i%3 == 0 and i%4 != 0]
print(list2)
